print('\nnormal')
print('\nЗадание 1')

# Задача-1:
# Дан список, заполненный произвольными целыми числами, получите новый список,
# элементами которого будут квадратные корни элементов исходного списка,
# но только если результаты извлечения корня не имеют десятичной части и
# если такой корень вообще можно извлечь
# Пример: Дано: [2, -5, 8, 9, -25, 25, 4]   Результат: [3, 5, 2]

import math
list_1=[2, -5, 8, 9, -25, 25, 16]
list_2=[]
for item in list_1:
    if item>0 and math.sqrt(item)%1 == 0:
        list_2.append(int(math.sqrt(item)))
print(list_2)


print('\nЗадание 2')
# Задача-2: Дана дата в формате dd.mm.yyyy, например: 02.11.2013.
# Ваша задача вывести дату в текстовом виде, например: второе ноября 2013 года.
# Склонением пренебречь (2000 года, 2010 года)

date = input ('Введите дату в формате dd.mm.yyyy: ')
new_date =  (date.split('.'))
day = {'01':'первое',
       '02':'второе',
       '03':'третье',
       '04':'четвертое',
       '05':'пятое',
       '06':'шестое',
       '07':'седьмое',
       '08':'восьмое',
       '09':'девятое',
       '10':'десятое',
       '11':'одинадцатое',
       '12':'двенадцатое',
       '13':'тринадцатое',
       '14':'четырнадцатое',
       '15':'пятьнадцатое',
       '16':'шестьнадцатое',
       '17':'семнадцатое',
       '18':'восемнадцатое',
       '19':'девятнадцатое',
       '20':'двадцатое',
       '21':'двадцать первое',
       '22':'двадцать второе',
       '23':'двадцать третье',
       '24':'двадцать четвертое',
       '25':'двадцать пятое',
       '26':'двадцать шестое',
       '27':'двадцать седьмое',
       '28':'двадцать восьмое',
       '29':'двадцать девятое',
       '30':'дридцатое',
       '31':'тридцать первое'}
month = {'01':'января',
         '02':'февраля',
         '03':'марта',
         '04':'апреля',
         '05':'мая',
         '06':'июня',
         '07':'июля',
         '08':'августа',
         '09':'сентября',
         '10':'октября',
         '11':'ноября',
         '12':'декабря'}
print('Сегодня {} {} {} года.'.format(day[new_date[0]], (month[new_date[1]]), new_date[2]))



print('\nЗадание 3')
# Задача-3: Напишите алгоритм, заполняющий список произвольными целыми числами
# в диапазоне от -100 до 100. В списке должно быть n - элементов.
# Подсказка:
# для получения случайного числа используйте функцию randint() модуля random

import random
count = int (input('Введите количество элементов: '))
mylist = []
n = 0
while n < count:
    mylist.append(random.randint(-100, 100))
    n +=1
print(mylist)

print('\nЗадание 4')
# Задача-4: Дан список, заполненный произвольными целыми числами.
# Получите новый список, элементами которого будут:
# а) неповторяющиеся элементы исходного списка:
# например, lst = [1, 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 2, 4, 5, 6]
# б) элементы исходного списка, которые не имеют повторений:
# например, lst = [1 , 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 4, 6]

# Решение а)
print('\n4-а')

list_3 = [1, 2, 4, 5, 6, 2, 5, 2]
new_list = set(list_3)
print(new_list)

# Решение б)
print('\n4-б')

list_4 = []
for item in list_3:
    if list_3.count(item) == 1:
        list_4.append(item)
print(list_4)
